{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.8", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"filters": 64, "name": "block1_conv1", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"filters": 64, "name": "block1_conv2", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "block1_pool", "padding": "valid", "trainable": false, "strides": [2, 2]}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"filters": 128, "name": "block2_conv1", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"filters": 128, "name": "block2_conv2", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "block2_pool", "padding": "valid", "trainable": false, "strides": [2, 2]}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"filters": 256, "name": "block3_conv1", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"filters": 256, "name": "block3_conv2", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"filters": 256, "name": "block3_conv3", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "block3_pool", "padding": "valid", "trainable": false, "strides": [2, 2]}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"filters": 512, "name": "block4_conv1", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"filters": 512, "name": "block4_conv2", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"filters": 512, "name": "block4_conv3", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "block4_pool", "padding": "valid", "trainable": false, "strides": [2, 2]}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"filters": 512, "name": "block5_conv1", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"filters": 512, "name": "block5_conv2", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"filters": 512, "name": "block5_conv3", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": false, "activation": "relu", "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "block5_pool", "padding": "valid", "trainable": false, "strides": [2, 2]}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "config": {"trainable": false, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Dense", "name": "fc1", "config": {"units": 1024, "name": "fc1", "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "predictions", "config": {"units": 2, "name": "predictions", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}]}}